app/views/teams/show.html.erb

SELECT "users".* FROM "users" INNER JOIN "user_team_relationships" ON "users"."id" = "user_team_relationships"."user_id" WHERE "user_team_relationships"."team_id" = ?  [["team_id", 1]]
---

<% @team.users.each do |user|%>