app/views/sprints/show.html.erb

<div class = "row">
  <% @sprint.tasks.each do |task| %>
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."sprint_id" = ?  [["sprint_id", 2]]