app/views/projects/show.html.erb

SELECT "sprints".* FROM "sprints" WHERE "sprints"."project_id" = ?  [["project_id", 1]]
---
			<ul>
			  <% @project.sprints.each do |sprint| %>