app/controllers/announcements_controller.rb

  def create
  @project = Project.find(params[:project_id])
  @announcement = @project.announcements.new(announcement_params)

  respond_to do |format|
  if @announcement.save
---
INSERT INTO "announcements" ("announcement", "created_at", "updated_at") VALUES (?, ?, ?)  [["announcement", "jasndjnda"], ["created_at", "2015-04-17 09:31:21.443970"], ["updated_at", "2015-04-17 09:31:21.443970"]]

		def set_announcement
		  @announcement = Announcement.find(params[:id])
---
SELECT  "announcements".* FROM "announcements" WHERE "announcements"."id" = ? LIMIT 1  [["id", 1]]