app/controllers/projects_controller.rb

  def create
    @project = Project.new(project_params)

    respond_to do |format|
      if @project.save
---
INSERT INTO "projects" ("title", "description", "deadline", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "asdasdas"], ["description", "adsad"], ["deadline", "2015-04-03"], ["created_at", "2015-04-03 15:19:35.376552"], ["updated_at", "2015-04-03 15:19:35.376552"]]