app/controllers/sprints_controller.rb

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 1]]
---
   def index
    @project = Project.find(params[:project_id])

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "sprints" ("number", "deadline", "project_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["number", 0], ["deadline", "2015-04-04"], ["project_id", 1], ["created_at", "2015-04-04 22:57:01.992048"], ["updated_at", "2015-04-04 22:57:01.992048"]]
---
   def create
    @project = Project.find(params[:project_id])
    @sprint = @project.sprints.new(sprint_params)

    respond_to do |format|
      if @sprint.save

SELECT  "sprints".* FROM "sprints" WHERE "sprints"."id" = ? LIMIT 1  [["id", 2]]
---
   def set_sprint
    @sprint = Sprint.find(params[:id])