app/controllers/tasks_controller.rb

  def index
    @sprint = Sprint.find(params[:sprint_id])
    if params[:sprint_id]
    @tasks = Task.where(sprint_id: params[:sprint_id]).order("deadline ASC")
---
SELECT  "sprints".* FROM "sprints" WHERE "sprints"."id" = ? LIMIT 1  [["id", 3]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."sprint_id" = ?  ORDER BY deadline ASC  [["sprint_id", 3]]

  def create
    @sprint = Sprint.find(params[:sprint_id])
    @project = Project.find(params[:project_id])
    @task = @sprint.tasks.new(task_params)

    respond_to do |format|
      if @task.save
---
SELECT  "sprints".* FROM "sprints" WHERE "sprints"."id" = ? LIMIT 1  [["id", 3]]
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "tasks" ("title", "description", "status", "priority", "story_points", "deadline", "sprint_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def set_task
    @task = Task.find(params[:id])
    @sprint = Sprint.find(params[:sprint_id])
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", 3]]
SELECT  "sprints".* FROM "sprints" WHERE "sprints"."id" = ? LIMIT 1  [["id", nil]]