app/controllers/teams_controller.rb

  def index
    @teams = Team.all
    @project = Project.find(params[:project_id])
---
SELECT "teams".* FROM "teams"
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @project = Project.find(params[:project_id])
    @team = @project.teams.new(team_params)


    respond_to do |format|
      if @team.save
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "teams" ("name", "project_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "ali_team"], ["project_id", 1], ["created_at", "2015-04-03 15:50:12.440406"], ["updated_at", "2015-04-03 15:50:12.440406"]]

    def set_team
      @team = Team.find(params[:id])
      @project = Project.find(params[:project_id])
---
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 1]]