app/controllers/users_controller.rb

  def index
    @users = User.search(params[:search])

    @task = Task.find(params[:id])
---
SELECT "users".* FROM "users" WHERE (email like '%ahmedzlaeh%')  ORDER BY created_at DESC
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", nil]]

  def create
     @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("email", "password_salt", "password_hash", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

  def add_task_to_user
    user_id = params[:user_id]
    task_id = params[:task_id]

    @user = User.find(user_id)
    @task = Task.find(task_id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", 2]]

  def add_user_to_team
    team_id = params[:team_id]
    user_id = params[:id]

    @team = Team.find(team_id)
    @user = User.find(user_id)

    @team.users << @user

    ## Ahmed Saleh
    ## Here we create an activity/notification everytime a user is added to a team
    ## and we set a special parameter :subject_id to team_id
    @user.create_activity :create, owner: current_user, parameters: {subject_id: team_id}
---
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "activities" ("parameters", "owner_id", "owner_type", "key", "trackable_id", "trackable_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)